{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Weekly Chore",
    "description": "",
    "home_page_url": "https://baday.bagikata.com",
    "feed_url": "https://baday.bagikata.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Adya Danaditya"
    },
    "items": [
        {
            "id": "https://baday.bagikata.com/product-management-is-a-mental-health-challenge.html",
            "url": "https://baday.bagikata.com/product-management-is-a-mental-health-challenge.html",
            "title": "Product management is a mental health challenge",
            "summary": "There. I've said it. And I posted it, to the full view of recruiters and colleagues that might think \"...this freak is another spoiled brat trying to put mental health as a cover for cracking under pressure and doing a crap job at work\" and&hellip;",
            "content_html": "<p>There. I've said it. And I posted it, to the full view of recruiters and colleagues that might think \"...<em>this freak is another spoiled brat trying to put mental health as a cover for cracking under pressure and doing a crap job at work</em>\" and put me out of the running on future PM jobs. I wrote the bulk of the piece around two year ago, has circulated it to limited friends and colleagues for it to 'mature', but only now have I mustered the courage to 'go public' with it.</p>\n<p>Don't get me wrong, product management is a really fulfilling job if done right, it seems to be a good fit for my skill set, and it <span style=\"text-decoration: underline;\"><strong>pays well</strong></span>. But ask any PMs you know - I guarantee nobody would say that it's an easy job. PM-ing is an arduous undertaking - and as I want to argue further, is a mental health challenge.</p>\n<p class=\"p1\">And anyone trying to enter the field have to prepare for that. Somebody has to say it out loud in the midst of all the romanticization about PMs - <em>and bootcamps selling the notion that is the easiest jumping point to tech without learning to code</em>. I recently had an long talk with a freshly minted product manager and I heard that after taking on a product management job, that particular person, whom I know very well as a very resilient person, suddenly became riddled with anxiety and panic attacks especially after waking up in the morning.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\">That fact didn’t surprise me one bit because truthfully, it’s an experience that has haunted me since the start of my career in the startup world / tech industry. This happened all the time with my friends and fellow colleagues. I saw the best of us crumble and fall, appearing and disappearing every once in a while due to burnout and mental health issues.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">I reflected a lot this last year and after 6-7 years in the industry, I tried to summarize basically why product management, in particular, is a tough proposition mentally:</p>\n<ul class=\"ul1\">\n<li class=\"li1\"><strong>Your job is basically to coax out certainty out of uncertain expectations</strong> (by your bosses, your stakeholders, you customers, and your team), and at some unfortunate times, you have to do it amidst political infighting</li>\n<li class=\"li1\"><strong>Things get personal: </strong>It’s hard to separate in your mind the product you manage and your own pride and dignity - if something goes wrong it’s very easy to take it personally</li>\n<li class=\"li1\">You’re <strong>accountable for things you are not in control of</strong>, like technical issues even your engineers don’t anticipate nor even imagine (most PMs I knew would say that it happened almost on a day to day basis) or a promo campaign gone bust, or a change in regulation that will bust your product if enacted</li>\n<li>A certain percent of the human population are assholes, and as you meet more people in comparison to say, engineers, designer or analysts - <strong>it is statistically inevitable that you frequent assholes from time to time</strong>.</li>\n<li class=\"li1\"><strong>Your process can look like a fail:</strong> You would definitely need failure and experiments to be certain of something but at any time someone could point that process as a sign of incompetence<span class=\"Apple-converted-space\"> </span></li>\n<li class=\"li3\">In a toxic culture, <strong>as you are everywhere, it is very easy to throw you under the bus</strong>. You get wary all the time and sometimes paranoid about things</li>\n</ul>\n<p class=\"p1\">A discussion of whether the job merits these points and whether a structural change is needed is another lengthy discussion, but for now, identifying what to do and how to cope is a good baby step to begin with. Here’s how I manage.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">Through my grad school readings in politics and the military, I learned 3 major strategies in dealing with a bad situation, and there’s a strategy that we can use here in this situation. It is aptly titled ‘embrace the suck’ - meaning to accept that a situation is bad, there’s nothing feasible we can do to change it, and what’s left is dealing with it. Dealing with it entails:</p>\n<p><strong>Internalizing the ‘serenity prayer’</strong></p>\n<p class=\"p4\">There’s a prayer created by Alcoholics Anonymous, a support group for people that have alcohol problems to help them get through it. I find it a really good solace and very much applies to my daily life in Product Management: “God, grant me the serenity to accept the things I cannot change, The courage to change the things I can, And the wisdom to know the difference.” Mic drop.</p>\n<p><strong>Savor the highs</strong></p>\n<p class=\"p4\">It’s okay to bask in the glory sometimes when you did something right or in the rare event where everything just went right. It keeps you going. Just make sure you put credits where credit is due and celebrate together. Get your engineers, designers, analysts and stakeholders in the party as well.</p>\n<p><strong>It’s okay to be vulnerable</strong></p>\n<p class=\"p4\">One of the things that makes it worse is to constantly dwell in denial - throw that away and don’t even try to pretend. Be honest if you’re struggling. The way ‘help’ worked is to let people know you need it. It doesn’t wander around looking and it will throw itself randomly at your door.</p>\n<p><strong>Find a support system</strong></p>\n<p class=\"p4\">This is harder than it sounds - and it’s very easy to feel like no one cares about you. But give them a chance and forgive them if they don’t rise up to the occasion. Let them know again. Value the ones that stayed.</p>\n<p><strong>Do something outside of work</strong></p>\n<p class=\"p5\">I’m not saying you should look for side gigs - you just need something to prove that your life is not equal to your current work. This can be gaming, social work, organizing, anything that gives life meaning and purpose without necessarily incurring you any burden. This will help you thread the fine line between your product and your personal agency. There’s another fine line to thread here, and you really have to own up your mistake, but if your feature, product, or initiative goes awry - it’s not ‘you’ that is bad. It’s usually just what you did at the moment given the circumstances that are bad and that doesn’t define you.</p>\n<p class=\"p1\">I hope you well with your sprint plannings, roadmaps, and retro sessions.</p>\n<p> </p>",
            "author": {
                "name": "Adya Danaditya"
            },
            "tags": [
            ],
            "date_published": "2023-04-25T20:14:00+07:00",
            "date_modified": "2023-04-25T20:14:00+07:00"
        }
    ]
}
